MessagingApplication/app/controllers/car_plates_controller.rb

  def index
    @car_plates = CarPlate.all
---
SELECT "car_plates".* FROM "car_plates"