MessagingApplication/app/controllers/message_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 1]]
---
  def delete
    @message = Message.find(params[:id])
    @message.destroy

INSERT INTO "messages" ("content", "created_at", "receiver", "sender", "subject", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @message = Message.new(params[:message])
    if @message.save