MessagingApplication/app/controllers/number_plates_controller.rb

SELECT "number_plates".* FROM "number_plates"
---
  def index
    @number_plates = NumberPlate.all

SELECT "number_plates".* FROM "number_plates" WHERE "number_plates"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @number_plate = NumberPlate.find(params[:id])

INSERT INTO "number_plates" ("authenified", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["authenified", false], ["country", ""], ["created_at", Tue, 11 Sep 2012 20:28:45 UTC +00:00], ["updated_at", Tue, 11 Sep 2012 20:28:45 UTC +00:00]]
---
  def create
    @number_plate = NumberPlate.new(params[:number_plate])

    respond_to do |format|
      if @number_plate.save